const { expect } = require('chai'); // Імпортуємо expect з Chai
const det = require('../src/det'); // Імпортуємо функцію det

describe('det', function() {
  it('повертає число, яке є детермінантом матриці', function() {
    // Перевіряємо, що функція det правильно обчислює детермінант матриці
    let a = [[2, 2, 4], [6, 6, 18], [15, 12, 48]];
    expect(det(a)).to.be.closeTo(36, 1e-10); // Враховуємо можливу похибку при обчисленні
  });

  it('повертає NaN, якщо передано не квадратну матрицю', function() {
    // Перевіряємо, що функція det повертає NaN для не квадратної матриці
    let a = [[2, 2, 4], [15, 12, 48]];
    expect(Number.isNaN(det(a))).to.be.true;
  });

  it('повертає 0, якщо матриця є сингулярною', function() {
    // Перевіряємо, що функція det повертає 0 для сингулярної матриці
    let a = [[1, 2, 3], [4, 5, 6], [7, 8, 9]];
    expect(det(a)).to.equal(0);
  });

  it('швидко обчислює детермінант діагональної матриці', function() {
    // Перевіряємо, що функція det правильно обчислює детермінант діагональної матриці
    let a = [
      [2,  0,   0,   0],
      [0, -4,   0,   0],
      [0,  0, 0.3,   0],
      [0,  0,   0, 1.2]
    ];
    expect(det(a)).to.be.closeTo(-2.88, 1e-10); // Враховуємо можливу похибку при обчисленні
  });
});
